In [1]:
import sqlite3 as sql
import pandas as pd

conn = sql.connect(database= "database.db")
cursor = conn.cursor()

In [2]:
# Clearing For Consecutive Full Runs
cursor.executescript("""
                    BEGIN;
                    DROP TABLE IF EXISTS Employee;
                    DROP TABLE IF EXISTS Department;
                    DROP TABLE IF EXISTS Female;
                    DROP TABLE IF EXISTS Male;
                    DROP TABLE IF EXISTS Project;
                    DROP TABLE IF EXISTS Salary;
                    DROP TABLE IF EXISTS Supervise;
                    DROP TABLE IF EXISTS WorksOn;
                    COMMIT;
                     """)

cursor.executescript("""
                    BEGIN;
                    CREATE TABLE Employee (employee_id INTEGER, employee_name TEXT);
                    CREATE TABLE Department (employee_name TEXT, department TEXT);
                    CREATE TABLE Female (name TEXT);
                    CREATE TABLE Male (name TEXT);
                    CREATE TABLE Project (project TEXT);
                    CREATE TABLE Salary (employee_name TEXT, salary INTEGER);
                    CREATE TABLE Supervise (supervisor TEXT, subordinate TEXT);
                    CREATE TABLE Workson (name TEXT, project TEXT, effort INTEGER);
                    COMMIT;
                    """)

In [3]:

cursor.executescript("""
                    BEGIN;
                    INSERT INTO Employee VALUES (1,'john');
                    INSERT INTO Employee VALUES (2, 'franklin');
                    INSERT INTO Employee VALUES (3, 'alicia');
                    INSERT INTO Employee VALUES (4, 'jennifer');
                    INSERT INTO Employee VALUES (5, 'ramesh');
                    INSERT INTO Employee VALUES (6, 'joyce');
                    INSERT INTO Employee VALUES (7, 'ahmad');
                    INSERT INTO Employee VALUES (8, 'james');
                    COMMIT;
                    """)

In [4]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Department VALUES ('john', 'research');
                    INSERT INTO Department VALUES ('franklin', 'research');
                    INSERT INTO Department VALUES ('alicia', 'administration');
                    INSERT INTO Department VALUES ('jennifer', 'administration');
                    INSERT INTO Department VALUES ('ramesh', 'research');
                    INSERT INTO Department VALUES ('joyce', 'research');
                    INSERT INTO Department VALUES ('ahmad', 'administration');
                    INSERT INTO Department VALUES ('james', 'headquarters');
                    COMMIT;
                    """)

In [5]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Female VALUES ('alicia');
                    INSERT INTO Female VALUES ('jennifer');
                    INSERT INTO Female VALUES ('joyce');
                    COMMIT;
                    """)

In [6]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Male VALUES ('john');
                    INSERT INTO Male VALUES ('franklin');
                    INSERT INTO Male VALUES ('ramesh');
                    INSERT INTO Male VALUES ('ahmad');
                    INSERT INTO Male VALUES ('james');
                    COMMIT;
                    """)

In [7]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Project VALUES ('productx');
                    INSERT INTO Project VALUES ('producty');
                    INSERT INTO Project VALUES ('productz');
                    INSERT INTO Project VALUES ('computerization');
                    INSERT INTO Project VALUES ('reorganization');
                    INSERT INTO Project VALUES ('newbenefits');
                    COMMIT;
                    """)

In [8]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Salary VALUES ('john', 30000);
                    INSERT INTO Salary VALUES ('franklin', 40001);
                    INSERT INTO Salary VALUES ('alicia', 25000);
                    INSERT INTO Salary VALUES ('jennifer', 43000);
                    INSERT INTO Salary VALUES ('ramesh', 38000);
                    INSERT INTO Salary VALUES ('joyce', 25000);
                    INSERT INTO Salary VALUES ('ahmad', 25000);
                    INSERT INTO Salary VALUES ('james', 55000);
                    COMMIT;
                    """)

In [9]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO Supervise VALUES ('franklin', 'john');
                    INSERT INTO Supervise VALUES ('franklin', 'ramesh');
                    INSERT INTO Supervise VALUES ('franklin', 'joyce');
                    INSERT INTO Supervise VALUES ('jennifer', 'alicia');
                    INSERT INTO Supervise VALUES ('jennifer', 'ahmad');
                    INSERT INTO Supervise VALUES ('james', 'franklin');
                    INSERT INTO Supervise VALUES ('james', 'jennifer');
                    COMMIT;
                    """)

In [10]:
cursor.executescript("""
                    BEGIN;
                    INSERT INTO WorksOn VALUES ('john', 'productx', 32);
                    INSERT INTO WorksOn VALUES ('john', 'producty', 8);
                    INSERT INTO WorksOn VALUES ('ramesh', 'productz', 40);
                    INSERT INTO WorksOn VALUES ('joyce', 'productx', 20);
                    INSERT INTO WorksOn VALUES ('joyce', 'producty', 20);
                    INSERT INTO WorksOn VALUES ('franklin', 'producty', 10);
                    INSERT INTO WorksOn VALUES ('franklin', 'productz', 10);
                    INSERT INTO WorksOn VALUES ('franklin', 'computerization', 10);
                    INSERT INTO WorksOn VALUES ('franklin', 'reorganization', 10);
                    INSERT INTO WorksOn VALUES ('alicia', 'newbenefits', 30);
                    INSERT INTO WorksOn VALUES ('alicia', 'computerization', 10);
                    INSERT INTO WorksOn VALUES ('ahmad', 'computerization', 35);
                    INSERT INTO WorksOn VALUES ('ahmad', 'newbenefits', 5);
                    INSERT INTO WorksOn VALUES ('jennifer', 'newbenefits', 20);
                    INSERT INTO WorksOn VALUES ('jennifer', 'reorganization', 15);
                    INSERT INTO WorksOn VALUES ('james', 'reorganization', 10);
                    COMMIT;
                    """)

In [11]:
cursor.close() # Cursor no longer active beyond this point.

In [12]:
# Show full Employee table
pd.read_sql_query("""
                  SELECT Employee_name
                  FROM Employee;
                  """, conn)

  employee_name
0          john
1      franklin
2        alicia
3      jennifer
4        ramesh
5         joyce
6         ahmad
7         james

In [13]:
# Show full department table
pd.read_sql_query("""
                  SELECT * 
                  FROM Department;
                  """, conn)

  employee_name      department
0          john        research
1      franklin        research
2        alicia  administration
3      jennifer  administration
4        ramesh        research
5         joyce        research
6         ahmad  administration
7         james    headquarters

In [14]:
pd.read_sql_query("""
                  SELECT * 
                  FROM Female;
                  """, conn)

       name
0    alicia
1  jennifer
2     joyce

In [15]:
pd.read_sql_query("""
                  SELECT * 
                  FROM Male;
                  """, conn)

       name
0      john
1  franklin
2    ramesh
3     ahmad
4     james

In [16]:
pd.read_sql_query("""
                  SELECT * 
                  FROM Project;
                  """, conn)

           project
0         productx
1         producty
2         productz
3  computerization
4   reorganization
5      newbenefits

In [17]:
pd.read_sql_query("""
                  SELECT *
                  FROM Salary;
                  """, conn)

  employee_name  salary
0          john   30000
1      franklin   40001
2        alicia   25000
3      jennifer   43000
4        ramesh   38000
5         joyce   25000
6         ahmad   25000
7         james   55000

In [18]:
pd.read_sql_query("""
                  SELECT *
                  FROM Supervise;
                  """, conn)

  supervisor subordinate
0   franklin        john
1   franklin      ramesh
2   franklin       joyce
3   jennifer      alicia
4   jennifer       ahmad
5      james    franklin
6      james    jennifer

In [19]:
pd.read_sql_query("""
                  SELECT *
                  FROM WorksOn;
                  """, conn)

        name          project  effort
0       john         productx      32
1       john         producty       8
2     ramesh         productz      40
3      joyce         productx      20
4      joyce         producty      20
5   franklin         producty      10
6   franklin         productz      10
7   franklin  computerization      10
8   franklin   reorganization      10
9     alicia      newbenefits      30
10    alicia  computerization      10
11     ahmad  computerization      35
12     ahmad      newbenefits       5
13  jennifer      newbenefits      20
14  jennifer   reorganization      15
15     james   reorganization      10

In [20]:
"""
Q1: Are there any Employees that are "female" and 
    that work in project "computerization" 
    with an effort of "10" hours per week, 
    and that have "jennifer" as a supervisor? 
    If so, list them.
"""

# Rutu
'''
pd.read_sql_query("""
SELECT e.employee_name
FROM employee e
JOIN female f ON e.employee_name = f.name
JOIN supervise s ON e.employee_name = s.subordinate
JOIN workson w ON e.employee_name = w.name
WHERE w.project = 'computerization' 
    AND w.effort = 10 
    AND s.supervisor = 'jennifer'
""", conn)
'''


# DRU
pd.read_sql_query("""
                  SELECT f.name AS 'Employee Name'
                  FROM Employee AS e
                  JOIN Female AS f 
                       ON f.name = e.employee_name
                  JOIN Supervise AS s 
                       ON f.name = s.subordinate
                  JOIN WorksOn AS w 
                       ON f.name = w.name
                       WHERE project = 'computerization'
                             AND effort = 10 
                             AND s.supervisor = 'jennifer';
                  """, conn)

  Employee Name
0        alicia

In [21]:
"""
Q2: Who is the employee who makes over "40000" dollars a year 
    and works for the "research" department?
"""

# RUTU
'''
pd.read_sql_query("""
SELECT e.employee_name
FROM employee e
JOIN department d ON e.employee_name = d.employee_name
JOIN salary s ON e.employee_name = s.employee_name
WHERE d.department = 'research' 
    AND s.salary > 40000
""", conn)
'''

# DRU
pd.read_sql_query("""
                  SELECT e.employee_name AS 'Employee Name'
                  FROM Employee AS e
                  JOIN Department AS d 
                       ON e.employee_name = d.employee_name
                  JOIN Salary AS s
                       ON e.employee_name = s.employee_name
                  WHERE department = 'research' AND salary > 40000;
                  """, conn)

  Employee Name
0      franklin

In [22]:
"""
Q3: Who is the supreme chief of this fictional company (aka the President)?
"""

# RUTU
'''
pd.read_sql_query("""
SELECT e.employee_name
FROM Employee e
JOIN Supervise s ON e.employee_name = s.supervisor
WHERE e.employee_name NOT IN (SELECT subordinate FROM Supervise)
""", conn)
'''

# DRU
pd.read_sql_query("""
                  SELECT e.employee_name AS 'President'
                  FROM Employee as e
                  WHERE e.employee_name NOT IN(SELECT subordinate 
                                               FROM Supervise);
                  """, conn)

  President
0     james

In [23]:
"""
Q4: Who are the individuals that work on project "productx" 
    with an effort of 20 or more hours a week?
"""
# RUTU
'''
pd.read_sql_query("""
                  SELECT e.employee_name AS 'Employee Name'
                  FROM Employee AS e
                  JOIN WorksOn AS w 
                       ON e.employee_name = w.name
                  WHERE project = 'productx' 
                        AND effort >= 20;
                  """, conn)
'''
# DRU
pd.read_sql_query("""
                  SELECT e.employee_name AS 'Employee Name'
                  FROM Employee AS e
                  WHERE e.employee_name IN(SELECT name
                                           FROM WorksOn
                                           WHERE project = 'productx'
                                           AND effort >= 20);
                """, conn)

  Employee Name
0          john
1         joyce